In [1]:
# Train test split Data

In [2]:
import pandas as pd 
import seaborn as sns

In [3]:
df=sns.load_dataset("titanic")

In [4]:
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [5]:
df2=df[['survived','pclass','age','parch']]

In [8]:
df3=df2.fillna(df.mean())
df3.head(5)

C:\Users\qavia\AppData\Local\Temp\ipykernel_22344\354735836.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3=df2.fillna(df.mean())

   survived  pclass   age  parch
0         0       3  22.0      0
1         1       1  38.0      0
2         1       3  26.0      0
3         1       1  35.0      0
4         0       3  35.0      0

In [10]:
X=df3.drop('survived',axis=1)
y=df3['survived']

print("shape of x",X.shape)
print("shape of x",y.shape)

shape of x (891, 3)
shape of x (891,)

In [11]:
from sklearn.model_selection import train_test_split

In [22]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=40)

In [23]:
print("shape of X_train",X_train.shape)
print("shape of X_test",X_test.shape)
print("shape of y_train",y_train.shape)
print("shape of y_test",y_test.shape)

shape of X_train (712, 3)
shape of X_test (179, 3)
shape of y_train (712,)
shape of y_test (179,)

In [30]:
X_train

     pclass   age  parch
661       3  40.0      0
393       1  23.0      0
266       3  16.0      1
144       2  18.0      0
446       2  13.0      1
..      ...   ...    ...
440       2  45.0      1
165       3   9.0      2
7         3   2.0      1
219       2  30.0      0
326       3  61.0      0

[712 rows x 3 columns]